// Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее
int a=5, b=7;
if (a>b)
{
    Console.WriteLine($"Число {a} больше чем {b}");
}
else
{
    Console.WriteLine($"Число {b} больше чем {a}");
}
// Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
int a, b, c;
Console.WriteLine("Введите первое число - ");
a = Convert.ToInt32(Console.Read());
Console.WriteLine("Введите второе число - ");
b = Convert.ToInt32(Console.Read());
Console.WriteLine("Введите третье число - ");
с = Convert.ToInt32(Console.Read());
